In [1]:
import pymysql
import json
import numpy as np
import pandas as pd

In [2]:
import json
config = {
  "host": "localhost",
  "port": 3306,
  "user": "root",
  "password": "123456789",
  "database": "online_store_dataset"
}
with open("D:/python/Online store dataset/Analysis data/notebooks/Python/config.json", "w") as outfile: 
    json.dump(config, outfile)

In [2]:
with open ("D:/python/Online store dataset/Analysis data/notebooks/Python/config.json","r") as config_file:
    db_config = json.load(config_file)

In [3]:
print(db_config)

{'host': 'localhost', 'port': 3306, 'user': 'root', 'password': '123456789', 'database': 'online_store_dataset'}

In [4]:
conn = pymysql.connect(
    host=db_config['host'],
    port=db_config['port'],
    user=db_config['user'],
    password=db_config['password'],
    database=db_config['database']
)

print("Connected to MySQL successfully!")

Connected to MySQL successfully!

In [5]:
name_tables_database = "show tables"
name_of_tabels =pd.read_sql(name_tables_database, conn)
name_of_tabels

C:\Users\user\Oracel19c\admin\orcl\Temp\ipykernel_9640\1478590201.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  name_of_tabels =pd.read_sql(name_tables_database, conn)

  Tables_in_online_store_dataset
0                      customers
1                      employees
2                        offices
3                   orderdetails
4                         orders
5                       payments
6                   productlines
7                       products

In [7]:
name_of_tabels["Tables_in_online_store_dataset"]

0       customers
1       employees
2         offices
3    orderdetails
4          orders
5        payments
6    productlines
7        products
Name: Tables_in_online_store_dataset, dtype: object

In [ ]:
import os
for table_name in name_of_tabels["Tables_in_online_store_dataset"]:
    query = f"SELECT * FROM {table_name}"
    df = pd.read_sql(query, conn)
    globals()[table_name] = df
    print(f"table ----- {table_name}")

In [14]:
variable_names = list(name_of_tabels["Tables_in_online_store_dataset"])
file_names = []
for i in range(len(variable_names)):
    a = f"""SELECT * from {name_of_tabels.iloc[i]["Tables_in_online_store_dataset"]}"""
    file_names.append(a)
for var_name, file_name in zip(variable_names, file_names):
    globals()[var_name] = pd.read_sql(file_name, conn)

for var_name in variable_names:
    globals()[var_name].to_csv(f'D:/python/Online store dataset/Analysis data/notebooks/Python/data/processed/dataframe/{var_name}.csv')

C:\Users\user\Oracel19c\admin\orcl\Temp\ipykernel_9640\3229501128.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  globals()[var_name] = pd.read_sql(file_name, conn)

In [13]:
payments

     customerNumber checkNumber paymentDate    amount
0               103    HQ336336  2004-10-19   6066.78
1               103    JM555205  2003-06-05  14571.44
2               103    OM314933  2004-12-18   1676.14
3               112    BO864823  2004-12-17  14191.12
4               112     HQ55022  2003-06-06  32641.98
..              ...         ...         ...       ...
268             495    BH167026  2003-12-26  59265.14
269             495    FN155234  2004-05-14   6276.60
270             496    EU531600  2005-05-25  30253.75
271             496    MB342426  2003-07-16  32077.44
272             496     MN89921  2004-12-31  52166.00

[273 rows x 4 columns]